app/Controllers/Iuran.php

    public function index()
    {
        $title = "Data Iuran Warga";
        $link = 'iuran';
        $model = new ModelIuran();
        $iuran = $model->findAll();
---
SELECT *
FROM `iuran`

    public function deletei($idiuran)
    {
        $ModelIuran = new ModelIuran();

        $title = "Hapus Iuran Warga";
        $link = "iuran/delete";

        $iuran = $ModelIuran->find($idiuran);
---
SELECT *
FROM `iuran`
WHERE `iuran`.`id` = '7'