app/Controllers/Warga.php

SELECT *
FROM `warga`
---
    public function index()
    {
        $title = "DATA WARGA";
        $link = "warga";

        $model = new ModelWarga();
        $warga = $model->findAll();

SELECT *
FROM `warga`
WHERE `warga`.`id` = '2'
---
    public function edit($id)
    {
        helper(['form', 'url']);

        $title = "Edit Data Warga";

        $ModelWarga = new ModelWarga();

        $data = array(
            'warga' => $ModelWarga->find($id)
        );

UPDATE `warga` SET `nik` = '12312312', `nama` = 'Sean Andaru', `kelamin` = 'L', `alamat` = 'Cikarang', `no_rumah` = '14', `status` = '1'
WHERE `warga`.`id` IN ('2')
---
                'validation' => $this->validator
            ]);
        }else{
            $ModelWarga->update($id, [
                'nik' => $this->request->getPost('nik'),
                'nama' => $this->request->getPost('nama'),
                'kelamin' => $this->request->getPost('kelamin'),
                'alamat' => $this->request->getPost('alamat'),
                'no_rumah' => $this->request->getPost('no_rumah'),
                'status' => $this->request->getPost('status'),
            ]);