app/Models/ModelWarga.php

INSERT INTO `warga` (`nik`, `nama`, `kelamin`, `alamat`, `no_rumah`, `status`) VALUES ('12312312', 'Sean', 'L', 'Cikarang', '14', '1')
---
    function add($data){
        return $this->db
        ->table($this->table)
        ->insert($data);